Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_FoundationLibraryRef/FoundationLibraryReference-level2.tmx
Source language: en_us
Languages: ja

source: A specialized error that provides a domain, error code, and user-info dictionary.
ja: ある領域、エラーコード、そしてユーザ情報辞書を提供する特殊化されたエラー。

source: A specialized error that provides localized messages describing the error and why it occurred.
ja: エラーとなぜそれが起こったかを記述しているローカライズされたメッセージを提供する特殊化されたエラー。

source: A specialized predicate that evaluates logical combinations of other predicates.
ja: 他の述部の論理結合を評価する特殊化された述部。

source: A specialized predicate that you use to compare expressions.
ja: 式を比較するためにあなたが使う特殊化された述部。

source: A specialized regular expression object that matches natural language text for predefined data patterns.
ja: ある特殊化された正規表現で、自然言語テキストをあらかじめ定義されたデータパターンと照合します。

source: A specific point in time, independent of any calendar or time zone.
ja: あらゆるカレンダーまたはタイムゾーンに影響を受けない、ある特定の時点。

source: A specified hour.
ja: 指定される時間。

source: A specified minute.
ja: 指定される分。

source: A specified second.
ja: 指定される秒。

source: A specifier for a range of objects in a container.
ja: あるコンテナの中のいくつかのオブジェクトからなるある範囲のための指定子。

source: A specifier for a simple attribute value, a one-to-one relationship, or all elements of a to-many relationship.
ja: ある単純な属性値、一対一関係（リレーションシップ）を、または対多関係のすべての要素のための指定子。

source: A specifier for an arbitrary object in a collection or, if not a one-to-many relationship, the sole object.
ja: あるコレクションの中の随意のオブジェクトまたは、一対多関係（リレーションシップ）でなければ、唯一のオブジェクトのための指定子。

source: A specifier for an insertion point in a container relative to another object in the container.
ja: そのコンテナ中の別のオブジェクトとの関係での、あるコンテナにおける挿入点のための指定子。

source: A specifier for an object in a collection (or container) by name.
ja: 名前による、あるコレクション（またはコンテナ）の中のあるオブジェクトに対する指定子。

source: A specifier for an object in a collection (or container) by unique ID.
ja: 特有なIDによる、あるコレクション（またはコンテナ）の中のあるオブジェクトのための指定。

source: A specifier indicating the middle object in a collection or, if not a one-to-many relationship, the sole object.
ja: あるコレクションの中の真ん中のオブジェクトまたは、一対多関係（リレーションシップ）でなければ、唯一のオブジェクトを指し示す指定子。

source: A specifier representing an object in a collection (or container) with an index number.
ja: あるインデックス数を使って、あるコレクション（またはコンテナ）の中のあるオブジェクトを表す指定子。

source: A specifier that indicates an object in a collection by its position relative to another object.
ja: あるオブジェクトをあるコレクションにおいて別のオブジェクトとの相対的なそれの位置によって指し示す指定子。

source: A specifier that indicates every object in a collection matching a condition.
ja: ある条件に合致している、あるコレクションの中のすべてのオブジェクトを指し示す指定子。

source: A static byte buffer that bridges to Data; use NSData when you need reference semantics or other Foundation-specific behavior.
ja: 静的バイトバッファ、それはDataにブリッジします；NSDataを、あなたが参照意味論または他のFoundation特有の挙動を必要とする場合に使ってください。

source: A static, ordered collection of unique objects.
ja: 固有なオブジェクトからなる静的な、順番付けられないコレクション。

source: A static, plain-text Unicode string object that bridges to String; use NSString when you need reference semantics or other Foundation-specific behavior.
ja: 静的な、プレーンテキストのユニコード文字列オブジェクト、それはStringにブリッジされます；あなたが参照意味論または他のFoundation特有の挙動を必要とする時はNSStringを使ってください。

source: A stream that provides read-only stream functionality.
ja: 読み出し専用ストリーム機能性を提供するストリーム。

source: A stream that provides write-only stream functionality.
ja: 書き込み専用ストリーム機能性を提供するストリーム。

source: A string containing date format patterns (such as “MM” or “h”).
ja: 日付書式設定パターンを含んでいる文字列（例えば “MM” や “h” など）。

source: A string containing the computer name.
ja: コンピュータ名を含んでいる文字列。

source: A string containing the formatted byte Count value.
ja: 書式設定されたbyte Count値を含んでいる文字列。

source: A string containing the full name of the current user.
ja: 現在のユーザのフルネームを含んでいる文字列。

source: A string containing the localized date and time information.
ja: ローカライズされた日付と時刻情報を含んでいる文字列。

source: A string containing the name of a Class.
ja: a Classの名前を含んでいる文字列。

source: A string containing the name of proto.
ja: protoの名前を含んでいる文字列。

source: A string containing the name of the class.
ja: クラスの名前を格納している文字列。

source: A string containing the path of the temporary directory for the current user.
ja: 現在のユーザのための一時的ディレクトリのパスを含んでいる文字列。

source: A string containing the source code of a script.
ja: あるスクリプトのソースコードを含んでいる文字列。

source: A string describing the map table’s contents.
ja: マップテーブルの内容を説明している文字列。

source: A string identifying the root directory of the user’s system.
ja: ユーザのシステムのルートディレクトリを識別している文字列。

source: A string object containing a path to a file.
ja: あるファイルへのパスを含んでいる文字列オブジェクト。

source: A string of any length, with any characters, that represents the name of a selector.
ja: セレクタの名前を表している、任意の文字を持つ、任意の長さの文字列。

source: A string of the form “{a
ja: 形式 “{a, b}” の文字列、

source: A string of the form “{a, b}”, where a and b are the width and height, respectively, of a Size.
ja: “{a, b}” からの文字列、そこにおいて a と b は、それぞれa Sizeの幅と高さです。

source: A string of the form “{x
ja: “{x, y}” からの文字列。

source: A string of the sort encoded by NSFile Type For HFSType Code().
ja: NSFile Type For HFSType Code()によってエンコードされるような類の文字列。

source: A string representation of a Selector.
ja: a Selectorの文字列表現。

source: A string representation of date formatted using the receiver’s current settings.
ja: レシーバの持つ現在の設定を使って書式設定されるdateの文字列表現。

source: A string representation of the Date, using the given locale, or if the locale argument is nil, in the international format YYYY-MM-DD HH: MM: SS ±HHMM, where ±HHMM represents the time zone offset in hours and minutes from UTC (for example, “2001-03-24 10: 45: 32 +0600”).
ja: Dateの文字列表現、与えられたロケールを使います、またはロケール引数がnilならば、国際書式YYYY-MM-DD HH: MM: SS ±HHMMにおいて、そこで±HHMMはUTCからのタイムゾーンオフセットを時間と分で表します（例えば、 “2001-03-24 10: 45: 32 +0600”）。

source: A string representation of the date object.
ja: 日付オブジェクトの文字列表現。

source: A string representation of the object.
ja: オブジェクトの文字列表現。

source: A string representation of the receiver, using the given locale, or if the locale argument is nil, in the international format YYYY-MM-DD HH: MM: SS ±HHMM, where ±HHMM represents the time zone offset in hours and minutes from UTC (for example, “2001-03-24 10: 45: 32 +0600”)
ja: レシーバの文字列表現、与えられたロケールを使います、またはロケール引数がnilならば、国際書式YYYY-MM-DD HH: MM: SS ±HHMMにおいて、そこで±HHMMはUTCからのタイムゾーンオフセットを時間と分で表します（例えば、 “2001-03-24 10: 45: 32 +0600”）。

source: A string specifying the identifier for a group of related resources.
ja: 関連リソースからなる１つのグループに対する識別子を指定している文字列。

source: A string that combines a value and a unit string appropriate for the formatter’s locale.
ja: 値と単位文字列をフォーマッタの持つロケールに適切に組み合わせる文字列。

source: A string that encodes full File Path‘s HFS file type, or nil if the operation was not successful
ja: full File PathのHFSファイルシステムをエンコードする文字列、または演算が成功しなかったならばnil

source: A string that encodes hfs File Type Code.
ja: hfs File Type Codeをエンコードする文字列。

source: A string that has associated attributes (such as visual style, hyperlinks, or accessibility data) for portions of its text.
ja: ある文字列、それはそれのテキスト部分に対する属性（視覚形式、ハイパーリンク、またはアクセシビリティ・データなど）と結び付けられるものです。

source: A string that names the group whose shared directory you want to obtain.
ja: あなたが取得するのを望む共有ディレクトリをそれが持つグループを指名する文字列。

source: A string that represents the contents of the receiving class.
ja: レシーバであるクラスの内容を表した文字列。

source: A string that specifies the text to be stored in the returned descriptor.
ja: 文字列、それは返される記述子の中に格納されるテキストを指定します。

source: A string with matching regular expressions replaced by the template string.
ja: テンプレート文字列と取り替えられた、正規表現にマッチしている文字列。

source: A structure representing a base-10 number.
ja: 底10の数を表している構造体。

source: A structure that parses URLs into and constructs URLs from their constituent parts.
ja: URLをそれへと構文解析する、そしてURLをそれらの構成パーツから構築する構造体。

source: A structure used to describe a portion of a series, such as characters in a string or objects in an array.
ja: あるシリーズの一部分、例えば文字列の中の文字または配列の中のオブジェクトを記述するのに使われる構造体。

source: A stub class that encapsulates security information about a file.
ja: あるファイルについての保安情報をカプセル化するスタブクラス。

source: A style that spells out the units and quantities of time.
ja: 時間の単位と量を略さずに綴るスタイル。

source: A style that spells out the units of time, but not the quantities.
ja: 時間の単位を略さずに綴る、しかし量はそうでないスタイル。

source: A style that uses a shortened spelling for units of time that is shorter than short.
ja: 時間の単位に対して、shortより短い短縮された綴りを使うスタイル。

source: A style that uses a shortened spelling for units.
ja: 単位に対して短縮された綴りを使うスタイル。

source: A style that uses the most abbreviated spelling for units of time.
ja: 時間の単位に対して最も省略された綴りを使うスタイル。

source: A style that uses the position of a unit of time to identify its value.
ja: 時間の単位の位置を使って、それの値を識別するスタイル。

source: A subrange of self to view.
ja: ビューのためのselfの下位範囲。

source: A subsequence leaving off the last element of the sequence.
ja: このシーケンスの最後の要素を取り除いたあるシーケンス。

source: A subsequence starting after the first element of the sequence.
ja: このシーケンスの最初の要素の後から始まるシーケンス。

source: A subsequence starting after the specified number of elements.
ja: 指定された数の要素の後から始まる下位シーケンス。

source: A subsequence starting at the start position.
ja: start位置から始まる下位シーケンス。

source: A subsequence starting at the beginning of this collection with at most max Length elements.
ja: このコレクションの先端で始まる多くともmax Length要素の下位シーケンス。

source: A subsequence terminating at the end of the collection with at most max Length elements.
ja: コレクションの末端で終わる多くともmax Length要素の下位シーケンス。

source: A subsequence that leaves off n elements from the end.
ja: ある下位シーケンス、それは終わりからn要素を取り除いたものです。

source: A subsequence up to, and including, the end position.
ja: end位置に至るまでの、そしてそれを含む、下位シーケンス。

source: A subsequence up to, but not including, the end position.
ja: end位置に至るまでの、しかしそれを含まないシーケンス。

source: A succinct label that identifies the accessibility element, in a localized string.
ja: ローカライズされた文字列での、アクセシビリティ要素を識別する簡潔なラベル。

source: A task must be running a run loop in one of the “common” modes, such as NSDefault Run Loop Mode, to receive a distributed notification.
ja: あるタスクは、分散通知を受け取るために、ある実行ループを “通常” モードの１つ、例えばNSDefault Run Loop Modeにおいて実行中でなければなりません。

source: A textual description of the calendar.
ja: カレンダーのテキスト記述。

source: A textual description of the character set suitable for debugging.
ja: その集合のテキスト表現、デバッグに適するもの。

source: A textual description of the character set.
ja: 文字集合のテキスト記述

source: A textual description of the data.
ja: データのテキスト記述。

source: A textual description of the date components suitable for debugging.
ja: デバッグに適する日付構成要素のテキスト表現。

source: A textual description of the date components.
ja: 日付構成要素のテキスト表現。

source: A textual description of the date interval suitable for debugging.
ja: デバッグに適する日付間隔のテキスト表現。

source: A textual description of the date interval.
ja: 日付間隔のテキスト記述。

source: A textual description of the date suitable for debugging.
ja: デバッグに適する日付のテキスト表現。

source: A textual description of the date value.
ja: 日付値のテキスト表現。

source: A textual description of the decimal.
ja: 10進数のテキスト表現。

source: A textual description of the index path suitable for debugging.
ja: デバッグに適するインデックスパスのテキスト記述。

source: A textual description of the index path.
ja: インデックスパスのテキスト記述。

source: A textual description of the index set suitable for debugging.
ja: デバッグに適したインデックス集合のテキスト記述。

source: A textual description of the index set.
ja: インデックス集合のテキスト記述。

source: A textual description of the index.
ja: インデックスのテキスト記述。

source: A textual description of the locale suitable for debugging.
ja: デバッグに適するこのロケールのテキスト表現。

source: A textual description of the transform suitable for debugging.
ja: 変換のテキスト表現、デバッグに適するもの。

source: A textual description of the transform.
ja: 変換のテキスト記述。

source: A textual description the data suitable for debugging.
ja: デバッグに適したデータのテキスト記述。

source: A time zone.
ja: あるタイムゾーン。

source: A transaction is a sequence of Apple events that are sent back and forth between client and server applications, beginning with the client’s initial request for a service.
ja: トランザクションは、クライアントのサーバーへの最初の要請で始まる、クライアントとサーバー・アプリケーションの間を行ったり来たり渡されるいくらかのアップルイベントからなる１つの連なりです。

source: A transformation specifies how points in one coordinate system are transformed to points in another coordinate system.
ja: ある変換は、どうやってある座標システムの中の点を別の座標システムの中の点に変換するかを指定します。

source: A two-dimensional size.
ja: ある２次元の大きさ。

source: A type code that identifies the type of enumerated data to be stored in the returned descriptor.
ja: ある型コード、それは、返される記述子の中に格納される、列挙されるデータの型を識別します。

source: A type representing an error value that can be thrown.
ja: スローされることが可能なあるエラー値を表している型。

source: A type that can be used as a key for encoding and decoding.
ja: エンコーディングとデコーディングのためのキーとして使われる型。

source: A type that can convert itself into and out of an external representation.
ja: それ自身を外部表現へとそしてそれをもとに変換できる型。

source: A type that can decode itself from an external representation.
ja: それ自身が外部表現からデコードできる型。

source: A type that can encode itself to an external representation.
ja: それ自身を外部表現へとエンコードできる型。

source: A type that can represent a string as a collection of characters.
ja: 文字列を文字のコレクションとして表すことができる型。

source: A type that conforms to Range Replaceable Collection can choose how to respond when this method is called.
ja: Range Replaceable Collectionに準拠する型は、このメソッドが呼ばれた時どのような応答をするか選ぶことができます。

source: A type that points to a particular node in an index path, similar to an array index.
ja: ある特定ノードをインデックスパスにおいて指すものの型、配列インデックスと似ています。

source: A type that represents a group of nodes in an index path.
ja: ノードいくらかからなるグループをインデックスパスにおいて表す型。

source: A type that represents one node of an index path.
ja: あるインデックスパスの１つのノードを表す型。

source: A type used to indicate a position in a data's buffer.
ja: データの持つバッファの中のある位置を指し示すために使われる型。

source: A type used to indicate a range of positions in a data's buffer.
ja: データの持つバッファの中のある範囲の位置を指し示すために使われる型。

source: A universally unique value that can be used to identify types, interfaces, and other items.
ja: 型、インターフェイス、そして他の項目を識別するために使うことができる普遍的に特有な値。

source: A user-defined key for providing context during encoding and decoding.
ja: エンコーディングおよびデコーディングの間にコンテキストを提供するためのユーザ定義のキー。

source: A valid index of the array.
ja: この配列の有効なインデックス。

source: A valid index of the collection to use as a limit.
ja: 限度として使うためのコレクションの有効なインデックス。

source: A valid index of the collection.
ja: コレクションのひとつの有効なインデックス。

source: A value indicating that a requested item couldn’t be found or doesn’t exist.
ja: 要求された項目が見つけられなかったまたは存在しないことを指し示す値。

source: A value less than or equal to the number of elements in the collection.
ja: このコレクションの中の要素の数より少ないか等しい値。

source: A value of 1.0 for either axis scales the content on that axis to the same size.
ja: どちらかの軸に対する1.0の値は、その軸上で内容を同じ大きさに拡大縮小します。

source: A value that determines how a type's coding keys are decoded from JSON keys.
ja: ある型の持つコーディングキーがJSONキーからデコードされる方法を決定する値。

source: A value that determines how a type's coding keys are encoded as JSON keys.
ja: ある型の持つコーディングキーがJSONキーとしてエンコードされる方法を決定する値。

source: A value that determines the readability, size, and element order of the encoded JSON object.
ja: エンコードされたJSONオブジェクトの読み出し可能性、サイズ、そして要素順序を決定する値。

source: A value that identifies the location of a resource, such as an item on a remote server or the path to a local file.
ja: あるリソース、例えばリモートサーバー上の項目の位置を識別する値、またはローカルファイルへのパス。

source: A value to compare.
ja: 比較する値。

source: A view of a string’s contents as a collection of UTF-16 code units.
ja: ある文字列の内容のひとつの見方、いくらかのUTF-16コード単位のコレクションとして。

source: A view of a string’s contents as a collection of UTF-8 code units.
ja: ある文字列の内容のひとつの見方、いくらかのUTF-8コード単位のコレクションとして。

source: A view of a string’s contents as a collection of Unicode scalar values.
ja: ある文字列の内容のひとつの見方、いくらかのユニコードスカラー値のコレクションとして。

source: A view onto this collection that provides lazy implementations of normally eager operations, such as map and filter.
ja: このコレクションのある見方で、それは通常は先行な演算、例えばmapやfilterなどの遅延な実装を提供します。

source: A week of the month or a count of weeks of the month.
ja: その月のある週またはその月の数え週。

source: A week of the year or count of the weeks of the year.
ja: その年のある週またはその年の数え週。

source: A weekday or count of weekdays.
ja: ある曜日または数え曜日。

source: A weekday ordinal or count of weekday ordinals.
ja: ある曜日序数または数え曜日序数。

source: A wrapper for the Apple event descriptor data type.
ja: アップルイベント記述子データ型に対するラッパー。

source: A year or count of years.
ja: ある年または数え年。

source: A zero-based array of NSNumber objects that identify the zero-based indices of the container objects that match specifier, or nil if no matching objects were found.
ja: NSNumberオブジェクトいくつかからなるゼロ起点配列で、specifierに合致するコンテナオブジェクトのゼロ起点インデックスを特定するもの、または合致するオブジェクトが見つけられなかったならばnil。

source: API which uses Date Components may have different behavior if this value is nil.
ja: Date Componentsを使うAPIは、この値がnilならば異なる挙動を持つかもしれません。

source: Accept all cookies.
ja: 全てのクッキーを受け入れます。

source: Accept cookies only from the main document domain.
ja: メインドキュメントドメインからのみクッキーを受け入れます。

source: Accepts a socket connection (for stream-type sockets only) in the background and creates a file handle for the “near” (client) end of the communications channel.
ja: バックグラウンドにおいてソケット接続を（ストリーム型ソケットのみに対して）試みます、そして通信経路の終端（クライアント）「近く」に対するファイルハンドルを作成します。

source: Access Nested Data
ja: 入れ子にされたデータにアクセスする

source: Access assets and other data bundled with your app.
ja: あなたのアプリと同梱される資産や他のデータにアクセスします。

source: Access by name, key, or ID
ja: 名前、キー、またはIDによってアクセスする

source: Access essential data types, collections, and operating-system services to define the base layer of functionality for your app.
ja: さまざまな本質的なデータ型、コレクション、そしてオペレーティングシステムのサービスにアクセスして、あなたのアプリのための機能性の基盤層を定義します。

source: Accesses a contiguous subrange of the collection’s elements.
ja: コレクションのもついくらかの要素からなるある連続した下位範囲にアクセスします。

source: Accesses a contiguous subrange of the index path's nodes.
ja: インデックスパスの持つノードの隣接下位範囲にアクセスします。

source: Accesses one element in the index set.
ja: インデックス集合の中の１つの要素にアクセスします。

source: Accesses one of the index path's nodes.
ja: インデックスパスの持つノードの１つにアクセスします。

source: Accesses the byte at the specified index.
ja: 指定されたインデックスでバイトにアクセスします。

source: Accesses the bytes at the specified range of indexes.
ja: 指定された範囲のインデックスでバイトにアクセスします。

source: Accesses the contiguous subrange of the collection’s elements specified by a range expression.
ja: 範囲式によって指定される、コレクションの要素からなる連続した下位範囲にアクセスします。

source: Accesses the default distributed notification center.
ja: 省略時の分散通知センターにアクセスします。

source: Accesses the item at the given index.
ja: 与えられたインデックスでの項目にアクセスします。

source: Accesses the items at the given range of indexes.
ja: 与えられたインデックスの範囲での項目それらにアクセスします。

source: Accesses the raw bytes in the data's buffer.
ja: データの持つバッファの中の生のバイトにアクセスします。

source: Accessing Bytes
ja: バイトにアクセスする

source: Accessing Cached Data
ja: キャッシュされたデータにアクセスする

source: Accessing Calendar Components
ja: カレンダー構成要素にアクセスする

source: Accessing Elements
ja: 要素にアクセスする

source: Accessing File Provider Services
ja: ファイルプロバイダサービスにアクセスする

source: Accessing File-Wrapper Information
ja: ファイルラッパー情報にアクセスする

source: Accessing Files
ja: ファイルにアクセスする

source: Accessing Hours and Seconds
ja: 時と秒にアクセスする

source: Accessing Indexes
ja: インデックスにアクセスする

source: Accessing Keys and Values
ja: キーと値にアクセスする

source: Accessing Months and Years
ja: 月と年にアクセスする

source: Accessing Nodes
ja: ノードにアクセスする

source: Accessing Start Date, End Date, and Duration
ja: 開始日付、終了日付、そして期間にアクセスする

source: Accessing Underlying Memory
ja: 基底メモリにアクセスする

source: Accessing User Directories
ja: ユーザディレクトリにアクセスする

source: Accessing Weeks and Days
ja: 週と日にちにアクセスする

source: Accessing a File Provider service’s remote proxy object.
ja: ファイルプロバイダサービスのリモートプロキシオブジェクトにアクセスする。

source: Accessing the Base Unit
ja: 基本単位にアクセスする

source: Accessing the Transformation Matrix
ja: 変換マトリックスにアクセスする

source: Accessing the Unit Converter
ja: 単位コンバータにアクセスする

source: Accessing the application’s handler
ja: アプリケーションのもつハンドラにアクセスする

source: Accessing the token in this property does not connect your app to its ubiquity containers.
ja: このプロパティの中のトークンにアクセスすることは、あなたのアプリをそれの偏在コンテナに接続しません。

source: Accessing the value of this property is relatively fast so you can check the value at launch time from your app’s main thread.
ja: このプロパティの値にアクセスすることは、比較的に高速なので、あなたはこの値をあなたのアプリのメインスレッドから起動時に確認できます。

source: Accumulating Tranformations
ja: 変換の蓄積

source: Accumulating Transformations
ja: 変換の累算

source: Acquiring more information about what is happening to the collection (for example, statistics gathering).
ja: コレクションに何が起こっているかについてもっと情報を取得する（例えば、統計を取る）。

source: Adding Codable to the inheritance list for Landmark triggers an automatic conformance that satisfies all of the protocol requirements from Encodable and Decodable:
ja: CodableをLandmarkに対する継承リストに加えることは、EncodableとDecodableからのプロトコル要件のすべてを満たす自動的準拠を引き起こします。

source: Adding Bytes
ja: バイトを加える

source: Adding Characters
ja: 文字を追加する

source: Adding Nodes
ja: ノードを追加する

source: Adding and Removing Cookies
ja: クッキーの追加と除去

source: Adding or Subtracting a Time Interval
ja: 時間間隔を加えたり引いたりする

source: Additional digits beyond the maximum required to represent the number of capture groups will be treated as ordinary characters, as will a $ not followed by digits.
ja: 捕獲グループの数を表すのに必要とされる最大を越えた追加の桁、そして桁が続かない$もまた普通の文字とみなされます。

source: Additional methods allow the implementer of a scriptable container class to provide fast access to elements that are being referenced by name and unique ID.
ja: 追加メソッドは、スクリプト対応コンテナクラスの実装側に、名前および固有IDによって参照されている要素への高速なアクセスを提供させます。

source: Additionally, if the file presenter that is monitoring the file is incorrectly configured so that it receives messages on the main operation queue, calling this method on the main thread can cause a deadlock.
ja: さらに加えて、ファイルを監視しているファイルプレゼンタが不正確に構成設定されることでそれがメイン演算キューでのメッセージを受け取るならば、このメソッドをメインスレッド上で呼び出すことは膠着状態を引き起こす可能性があります。

source: Adds left Operand to right Operand and stores the sum in result.
ja: left Operandをright Operandに加えて、合計をresultに格納します。

source: Adds a child file wrapper to the receiver, which must be a directory file wrapper.
ja: 子ファイルラッパーをレシーバに追加します、それはディレクトリファイルラッパーでなければなりません。

source: Adds a descriptor to the receiver as an Apple event parameter identified by the specified keyword.
ja: 指定されたキーワードで識別されるアップルイベントパラメータとして、ひとつの記述子をレシーバに加えます。

source: Adds a descriptor to the receiver as an attribute identified by the specified keyword.
ja: 指定されたキーワードで識別される属性として、ある記述子をレシーバに加えます。

source: Adds a descriptor, identified by a keyword, to the receiver.
ja: あるキーワードによって識別される１つの記述子をレシーバに加えます。

source: Adds a notification to the notification queue with a specified posting style, criteria for coalescing, and run loop mode.
ja: ある通知を通知キューに、指定された投函スタイル、結合する基準、そして実行ループモードで加えます。

source: Adds a time interval to a date.
ja: ある時間間隔を日付に加えます。

source: Adds a time interval to this date.
ja: 時間間隔をこの日付に加えます。

source: Adds an array of cookies to the receiver if the receiver’s cookie acceptance policy permits.
ja: クッキーからなる配列をレシーバに加えます、もしレシーバの持つクッキー受入方針が許可するならば。

source: Adds an element to the end of the collection.
ja: ある要素をコレクションの終わりに加えます。

source: Adds an element to the specified hash table only if the table does not already contain the element.
ja: 指定されたハッシュテーブルに要素を、そのテーブルがまだその要素を含まない場合にのみ、追加します。

source: Adds an element to the specified hash table.
ja: ある要素を、指定されたハッシュテーブルに追加します。

source: Adds an entry to the notification center's dispatch table with an observer, a selector, and an optional notification name and sender.
ja: ある登録項目を通知センターのディスパッチテーブルに、オブザーバ、セレクタ、そして任意の通知名と送り手とともに加えます。

source: Adds an entry to the receiver’s dispatch table with a specific observer and suspended-notifications behavior, and optional notification name and sender.
ja: ある登録項目をレシーバのディスパッチテーブルに、特定オブザーバと待機通知挙動、そして任意の通知名と送り手とともに加えます。

source: Adds the elements of a sequence or collection to the end of this collection.
ja: あるシーケンスまたコレクションに属するいくつかの要素をこのコレクションの終わりに加えます。

source: Adds the given element to the option set if it is not already a member.
ja: 与えられた要素を、それがすでにメンバでないならばオプションセットに加えます。

source: Adds the specified block to the receiver’s list of blocks to perform.
ja: 指定されたブロックをレシーバの持つブロックのリストに加えて、実行します。

source: Adds two decimal numbers, storing the result in the first number.
ja: ２つの10進数を加算します、結果を最初の数に格納します。
